In [1]:
import sys
print(sys.version)
import numpy as np
print(np.__version__)
import pandas as pd
print(pd.__version__)
import matplotlib.pyplot as plt

%matplotlib inline

3.6.1 |Anaconda 4.4.0 (64-bit)| (default, May 11 2017, 13:25:24) [MSC v.1900 64 bit (AMD64)]
1.12.1
0.20.1

## Applying Functions to DataFrames

Each subsequent exercise ramps up in difficulty. Sample answers are in a separate folder with an explanation (there might be multiple ways to solve a problem though!)

- Use Pandas "read_csv()" function to import the gradebook_v3 file.

In [4]:
gradebook = pd.read_csv('gradebook_v3.csv')
gradebook

     student  final letter_grade  midterm
0        Ben   85.0            B     88.0
1        May   82.0            C     78.0
2        Sue   51.0            C     92.0
3      Blake   85.0            C     56.0
4        Amy    NaN            C     79.0
5      Steve   79.0            C      NaN
6       Anna   90.0            B     88.0
7        Bob   25.0            F     12.0
8      Chris   80.0            C     40.0
9       Paul   94.0            A     98.0
10  Samantha   88.0            B     92.0

Find the:
+ Mean score of each exam.
+ The mean final score for students who did not get a letter_grade of an 'F'
+ The 'count' of students who got a letter grade of 'C'

In [12]:
print(gradebook.midterm.mean())
print(gradebook.final.mean())

72.3
75.9

In [14]:
gradebook[gradebook.letter_grade != 'F'].final.mean()

81.55555555555556

In [15]:
gradebook[gradebook.letter_grade == 'C'].final.count()

5

Use the "apply" function to:
+ Create a new variable called "midterm_curved" which adds 5 to each score.
+ Create a new variable called "average_exam" which is the average of both exams.

Hint - What do you need to specify as the axis?

In [35]:
gradebook['midterm_curved'] = gradebook.apply(lambda x: x.midterm + 5, axis=1)

In [36]:
gradebook

     student  final letter_grade  midterm  midterm_curved
0        Ben   85.0            B     88.0            93.0
1        May   82.0            C     78.0            83.0
2        Sue   51.0            C     92.0            97.0
3      Blake   85.0            C     56.0            61.0
4        Amy    NaN            C     79.0            84.0
5      Steve   79.0            C      NaN             NaN
6       Anna   90.0            B     88.0            93.0
7        Bob   25.0            F     12.0            17.0
8      Chris   80.0            C     40.0            45.0
9       Paul   94.0            A     98.0           103.0
10  Samantha   88.0            B     92.0            97.0

In [37]:
gradebook['average_exam'] = gradebook.apply(lambda x: (x.midterm + x.final) / 2, axis=1)

In [38]:
gradebook

     student  final letter_grade  midterm  midterm_curved  average_exam
0        Ben   85.0            B     88.0            93.0          86.5
1        May   82.0            C     78.0            83.0          80.0
2        Sue   51.0            C     92.0            97.0          71.5
3      Blake   85.0            C     56.0            61.0          70.5
4        Amy    NaN            C     79.0            84.0           NaN
5      Steve   79.0            C      NaN             NaN           NaN
6       Anna   90.0            B     88.0            93.0          89.0
7        Bob   25.0            F     12.0            17.0          18.5
8      Chris   80.0            C     40.0            45.0          60.0
9       Paul   94.0            A     98.0           103.0          96.0
10  Samantha   88.0            B     92.0            97.0          90.0

- Run the "describe()" function on each of your numeric variables, and the "value_counts()" function on your letter_grade.

In [40]:
gradebook.describe()

           final    midterm  midterm_curved  average_exam
count  10.000000  10.000000       10.000000      9.000000
mean   75.900000  72.300000       77.300000     73.555556
std    21.377298  27.793085       27.793085     23.585542
min    25.000000  12.000000       17.000000     18.500000
25%    79.250000  61.500000       66.500000     70.500000
50%    83.500000  83.500000       88.500000     80.000000
75%    87.250000  91.000000       96.000000     89.000000
max    94.000000  98.000000      103.000000     96.000000

In [42]:
gradebook.letter_grade.value_counts()

C    6
B    3
A    1
F    1
Name: letter_grade, dtype: int64